In [1]:
#Data structures
import pandas as pd
import numpy as np

In [2]:
#Series
# converting tuple to Series
h = ('AA', '2012-02-01', 100, 10.2)
s = pd.Series(h)
type(s)

pandas.core.series.Series

In [3]:
print(s)

0            AA
1    2012-02-01
2           100
3          10.2
dtype: object

In [4]:
# converting dict to Series
d = {'name' : 'IBM', 'date' : '2010-09-08', 'shares' : 100, 'price' : 10.2}
ds = pd.Series(d)
type(ds)

pandas.core.series.Series

In [5]:
print(ds)

name             IBM
date      2010-09-08
shares           100
price           10.2
dtype: object

In [6]:
f = ['FB', '2001-08-02', 90, 3.2]
f = pd.Series(f, index = ['name', 'date', 'shares', 'price'])
print(f)

name              FB
date      2001-08-02
shares            90
price            3.2
dtype: object

In [7]:
f['shares']

90

In [8]:
f[0]

'FB'

In [9]:
f[['shares', 'price']]

shares     90
price     3.2
dtype: object

In [10]:
#Day 8
#Creating series from scalar
s = pd.Series(50, index=[0,1,2,3,4])
print(s)

0    50
1    50
2    50
3    50
4    50
dtype: int64

In [11]:
#Mathematical Operations in Series
s = pd.Series([1,2,3,4,5])
print("To multiply all values in the series by 2")
print("------------------------------------------")
print(s*2)
print("To find the square of all values in the series")
print("------------------------------------------")
print(s**2)
print("To print all values in a series that are greater than 2")
print("------------------------------------------")
print(s[s>2])

To multiply all values in the series by 2
------------------------------------------
0     2
1     4
2     6
3     8
4    10
dtype: int64
To find the square of all values in the series
------------------------------------------
0     1
1     4
2     9
3    16
4    25
dtype: int64
To print all values in a series that are greater than 2
------------------------------------------
2    3
3    4
4    5
dtype: int64

In [12]:
s1 = pd.Series([1,2,3,4,5], index= ['a','b','c','d','e'])
s2 = pd.Series([10,20,30,40,50], index= ['a','b','c','d','e'])
s3 = pd.Series([5,14,23,32], index= ['a','b','c','d'])
print("To add Series1 & series2")
print("------------------------------------------")
print(s1+s2)
print("To add Series2 & series3")
print("------------------------------------------")
print(s2+s3)
print("To add Series2 & series3 and Filled Non Matching Index with 0")
print("------------------------------------------")
print(s2.add(s3,fill_value=0))

To add Series1 & series2
------------------------------------------
a    11
b    22
c    33
d    44
e    55
dtype: int64
To add Series2 & series3
------------------------------------------
a    15.0
b    34.0
c    53.0
d    72.0
e     NaN
dtype: float64
To add Series2 & series3 and Filled Non Matching Index with 0
------------------------------------------
a    15.0
b    34.0
c    53.0
d    72.0
e    50.0
dtype: float64

In [13]:
#selecting in series
arr = np.array([10,15,18,22,55,77])
s = pd.Series(arr)
print(s)
print("------------------------")
print(s.loc[:2])
print(s.iloc[:2])

print("------------------------")
print(s.loc[3:4])
print(s.iloc[3:4])
print("------------------------")
s.loc[2:3]
print("------------------------")
s.iloc[2:3]
print(s[1])
print("\n")
print(s[3:4])
s[:3]

0    10
1    15
2    18
3    22
4    55
5    77
dtype: int32
------------------------
0    10
1    15
2    18
dtype: int32
0    10
1    15
dtype: int32
------------------------
3    22
4    55
dtype: int32
3    22
dtype: int32
------------------------
------------------------
15


3    22
dtype: int32

0    10
1    15
2    18
dtype: int32

In [14]:
#Indexing in Series
arr= np.array(['a','b','c','d'])
s = pd.Series(arr,index=['first','second','third','fourth'])
print(s)
#To print only indexes in series
print('\n indexes in Series are:::')
s.index

first     a
second    b
third     c
fourth    d
dtype: object

 indexes in Series are:::

Index(['first', 'second', 'third', 'fourth'], dtype='object')

In [15]:
#Slicing in Series
arr = np.array([10,15,18,22,55,77])
s = pd.Series(arr, index=['A','B','C','D','E','F'])
print(s)
print(s[1:5:2])
print(s[0:6:2])

A    10
B    15
C    18
D    22
E    55
F    77
dtype: int32
B    15
D    22
dtype: int32
A    10
C    18
E    55
dtype: int32

In [16]:
#Dataframes
#How to create Dataframe From dict
data = { 'name' : ['AA', 'IBM', 'GOOG'],
'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
'shares' : [100, 30, 90],
'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [17]:
df

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [18]:
#adding a new column
df['owner']= 'Unknown'
df

   name        date  shares  price    owner
0    AA  2001-12-01     100   12.3  Unknown
1   IBM  2012-02-10      30   10.3  Unknown
2  GOOG  2010-04-09      90   32.2  Unknown

In [19]:
#changing the indexing
df.index=['one','two','three']
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  Unknown
two     IBM  2012-02-10      30   10.3  Unknown
three  GOOG  2010-04-09      90   32.2  Unknown

In [20]:
df= df.set_index(['name'])
df

            date  shares  price    owner
name
AA    2001-12-01     100   12.3  Unknown
IBM   2012-02-10      30   10.3  Unknown
GOOG  2010-04-09      90   32.2  Unknown

In [21]:
# access data using column-index
df['shares']

name
AA      100
IBM      30
GOOG     90
Name: shares, dtype: int64

In [23]:
#Day 9
# creating an empty dataframe
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [26]:
#How to create Dataframe From Series
s = pd.Series(['a','b','c','d'])
df = pd.DataFrame(s)
print(df)

   0
0  a
1  b
2  c
3  d

In [27]:
#Iteration on Rows and Columns
l = [{'Name' : 'Agnes', 'SurName' : 'Murigi'},
    {'Name' : 'San', 'SurName' : 'Verma'}]
df1 = pd.DataFrame(l)
print(df1)
for(row_index,row_value) in df1.iterrows():
    print('\n Row index is ::',row_index)
    print("Row value is ::")
    print(row_value)

    Name SurName
0  Agnes  Murigi
1    San   Verma

 Row index is :: 0
Row value is ::
Name        Agnes
SurName    Murigi
Name: 0, dtype: object

 Row index is :: 1
Row value is ::
Name         San
SurName    Verma
Name: 1, dtype: object

In [28]:
l = [{'Name' : 'Agnes', 'SurName' : 'Murigi'},
    {'Name' : 'San', 'SurName' : 'Verma'}]
df1 = pd.DataFrame(l)
print(df1)
for(col_index,col_value) in df1.iteritems():
    print('\n Column Name is ::',col_index)
    print("Column values are ::")
    print(col_value)

    Name SurName
0  Agnes  Murigi
1    San   Verma

 Column Name is :: Name
Column values are ::
0    Agnes
1      San
Name: Name, dtype: object

 Column Name is :: SurName
Column values are ::
0    Murigi
1     Verma
Name: SurName, dtype: object

C:\Users\user\AppData\Local\Temp\ipykernel_25316\2632520963.py:5: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for(col_index,col_value) in df1.iteritems():

In [29]:
#Select operation in data frame (df[empid])
data = { 'name' : ['AA', 'IBM', 'GOOG'],
'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
'shares' : [100, 30, 90],
'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
print(df)

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [31]:
df['name']

0      AA
1     IBM
2    GOOG
Name: name, dtype: object

In [33]:
df[['name','date']]

   name        date
0    AA  2001-12-01
1   IBM  2012-02-10
2  GOOG  2010-04-09

In [34]:
#To Add & Rename a column in dataframe
s = pd.Series([10,15,18,22])
df=pd.DataFrame(s)
df.columns=['List1'] 
df['List2']=20 
df['List3']=df['List1']+df['List2']

print(df)

   List1  List2  List3
0     10     20     30
1     15     20     35
2     18     20     38
3     22     20     42

In [35]:
#To Delete a Column in data frame
del df['List3']
print(df)

   List1  List2
0     10     20
1     15     20
2     18     20
3     22     20

In [37]:
df.pop('List2')
print(df)

   List1
0     10
1     15
2     18
3     22

In [40]:
#To Delete a Column Using drop()
s= pd.Series([10,20,30,40])
df=pd.DataFrame(s)
df.columns=['List1']
df['List2']=40
df1=df.drop('List2',axis=1) #(axis=1) means to delete Data column wise
df2=df.drop(index=[2,3],axis=0) #(axis=0) #means to delete data row wise with given index
print(df)
print('After deletion::')
print(df1)
print (' After row deletion::')
print(df2)

   List1  List2
0     10     40
1     20     40
2     30     40
3     40     40
After deletion::
   List1
0     10
1     20
2     30
3     40
 After row deletion::
   List1  List2
0     10     40
1     20     40